GenSayer/qemu-system-ia64/hw/isa/lpc47b27.c
/*
 * LPC47B27x ISA integration
 *
 * Models configuration ports 0x2e/0x2f, Serial 1, the keyboard, and an
 * unconnected SPP/ECP parallel port. Parallel DMA and EPP transfers are not
 * implemented. Serial and keyboard CRF0 mode values are retained for readback
 * and migration, but their effects on device behavior are not implemented.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"

#include "hw/char/serial.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/sysbus.h"
#include "hw/input/i8042.h"
#include "hw/isa/isa.h"
#include "hw/isa/lpc47b27.h"
#include "hw/isa/lpc47b27_config.h"
#include "migration/vmstate.h"
#include "qapi/error.h"
#include "qemu/error-report.h"
#include "qemu/module.h"
#include "trace.h"

#define LPC47B27_CONFIG_IO_SIZE          2
#define LPC47B27_UART_IO_SIZE            8
#define LPC47B27_I8042_MMIO_SIZE         5
#define LPC47B27_I8042_COMMAND_MASK      4
#define LPC47B27_I8042_DATA_PORT         UINT16_C(0x0060)
#define LPC47B27_I8042_COMMAND_PORT      UINT16_C(0x0064)
#define LPC47B27_UART_CLOCK_DIVISOR       16U
#define LPC47B27_UART_INPUT_CLOCK_HZ      UINT32_C(1843200)
#define LPC47B27_PARALLEL_FIFO_SIZE       16
#define LPC47B27_PARALLEL_DIRECTION       BIT(5)
#define LPC47B27_PARALLEL_SERVICE         BIT(2)
#define LPC47B27_PARALLEL_DMA             BIT(3)

enum LPC47B27IRQSource {
    LPC47B27_IRQ_SOURCE_UART,
    LPC47B27_IRQ_SOURCE_I8042_KBD,
    LPC47B27_IRQ_SOURCE_I8042_MOUSE,
    LPC47B27_IRQ_SOURCE_PARALLEL,
    LPC47B27_IRQ_SOURCE_COUNT = LPC47B27_IRQ_ROUTER_SOURCE_COUNT,
};

struct LPC47B27ISAState {
    ISADevice parent_obj;

    LPC47B27ConfigState config;
    MemoryRegion config_io;
    SerialState uart;
    MMIOKBDState i8042;
    MemoryRegion i8042_data_alias;
    MemoryRegion i8042_command_alias;
    MemoryRegion parallel_io;
    MemoryRegion parallel_ecp_io;
    uint8_t parallel_data;
    uint8_t parallel_control;
    uint8_t parallel_ecr;
    uint8_t parallel_fifo[LPC47B27_PARALLEL_FIFO_SIZE];
    uint8_t parallel_head;
    uint8_t parallel_count;
    uint8_t parallel_last;

    ISABus *isa_bus;
    MemoryRegion *io_space;
    uint16_t config_iobase;
    uint16_t uart_mapped_base;
    uint16_t parallel_mapped_base;
    uint32_t uart_input_clock_hz;
    uint8_t routed_irq[LPC47B27_IRQ_SOURCE_COUNT];
    bool source_level[LPC47B27_IRQ_SOURCE_COUNT];
    bool irq_level[ISA_NUM_IRQS];

    bool config_mapped;
    bool uart_mapped;
    bool i8042_mapped;
    bool parallel_mapped;
    bool parallel_ecp_mapped;
    bool uart_realized;
    bool i8042_realized;
    bool resources_ready;
};

static void lpc47b27_update_irq(LPC47B27ISAState *s, uint8_t irq)
{
    bool level;

    if (!irq) {
        return;
    }
    level = lpc47b27_irq_router_level(s->routed_irq, s->source_level, irq);
    if (s->irq_level[irq] != level) {
        s->irq_level[irq] = level;
        qemu_set_irq(isa_bus_get_irq(s->isa_bus, irq), level);
    }
}

static void lpc47b27_set_irq_target(LPC47B27ISAState *s,
                                    enum LPC47B27IRQSource source,
                                    uint8_t irq, bool drive)
{
    uint8_t old_irq = s->routed_irq[source];

    g_assert(irq < ISA_NUM_IRQS);
    if (old_irq == irq) {
        return;
    }

    s->routed_irq[source] = irq;
    if (drive) {
        lpc47b27_update_irq(s, old_irq);
        lpc47b27_update_irq(s, irq);
    }
}

static void lpc47b27_set_irq_source(void *opaque, int n, int level)
{
    LPC47B27ISAState *s = LPC47B27_ISA(opaque);

    g_assert(n >= 0 && n < LPC47B27_IRQ_SOURCE_COUNT);
    level = !!level;
    if (s->source_level[n] == level) {
        return;
    }

    s->source_level[n] = level;
    if (s->routed_irq[n]) {
        lpc47b27_update_irq(s, s->routed_irq[n]);
    }
}

static void lpc47b27_disconnect_irqs(LPC47B27ISAState *s)
{
    unsigned i;

    for (i = 0; i < LPC47B27_IRQ_SOURCE_COUNT; i++) {
        lpc47b27_set_irq_target(s, i, 0, true);
    }
}

static void lpc47b27_rebuild_irq_cache(LPC47B27ISAState *s)
{
    unsigned irq;

    memset(s->irq_level, 0, sizeof(s->irq_level));
    for (irq = 1; irq < ISA_NUM_IRQS; irq++) {
        s->irq_level[irq] = lpc47b27_irq_router_level(
            s->routed_irq, s->source_level, irq);
    }
}

static void lpc47b27_unmap_uart(LPC47B27ISAState *s)
{
    if (s->uart_mapped) {
        memory_region_del_subregion(s->io_space, &s->uart.io);
        s->uart_mapped = false;
    }
}

static void lpc47b27_unmap_i8042(LPC47B27ISAState *s)
{
    if (s->i8042_mapped) {
        memory_region_del_subregion(s->io_space,
                                    &s->i8042_command_alias);
        memory_region_del_subregion(s->io_space, &s->i8042_data_alias);
        s->i8042_mapped = false;
    }
}

static void lpc47b27_unmap_parallel(LPC47B27ISAState *s)
{
    if (s->parallel_ecp_mapped) {
        memory_region_del_subregion(s->io_space, &s->parallel_ecp_io);
        s->parallel_ecp_mapped = false;
    }
    if (s->parallel_mapped) {
        memory_region_del_subregion(s->io_space, &s->parallel_io);
        s->parallel_mapped = false;
    }
}

static unsigned lpc47b27_parallel_mode(LPC47B27ISAState *s)
{
    return (s->config.parallel_mode & 2) ? s->parallel_ecr >> 5 :
           (s->config.parallel_mode & 7) == 4 ? 0 : 1;
}

static void lpc47b27_parallel_service(LPC47B27ISAState *s)
{
    unsigned mode = lpc47b27_parallel_mode(s);
    /* FIFO thresholds 15 and 16 both require at least one byte to service. */
    unsigned threshold = MAX(1, 15 - ((s->config.parallel_mode >> 3) & 15));
    bool reverse = mode != 2 &&
                   (s->parallel_control & LPC47B27_PARALLEL_DIRECTION);
    unsigned available = reverse ? s->parallel_count :
                         LPC47B27_PARALLEL_FIFO_SIZE - s->parallel_count;

    if ((mode == 2 || mode == 3 || mode == 6) &&
        !(s->parallel_ecr & (LPC47B27_PARALLEL_SERVICE |
                            LPC47B27_PARALLEL_DMA)) &&
        available >= threshold) {
        s->parallel_ecr |= LPC47B27_PARALLEL_SERVICE;
        lpc47b27_set_irq_source(s, LPC47B27_IRQ_SOURCE_PARALLEL, 1);
    }
}

static void lpc47b27_parallel_push(LPC47B27ISAState *s, uint8_t value)
{
    if (s->parallel_count < LPC47B27_PARALLEL_FIFO_SIZE) {
        s->parallel_fifo[(s->parallel_head + s->parallel_count) %
                         LPC47B27_PARALLEL_FIFO_SIZE] = value;
        s->parallel_count++;
    }
    lpc47b27_parallel_service(s);
}

static uint8_t lpc47b27_parallel_pop(LPC47B27ISAState *s)
{
    if (s->parallel_count) {
        s->parallel_last = s->parallel_fifo[s->parallel_head];
        s->parallel_head = (s->parallel_head + 1) %
                          LPC47B27_PARALLEL_FIFO_SIZE;
        s->parallel_count--;
    }
    lpc47b27_parallel_service(s);
    return s->parallel_last;
}

static void lpc47b27_sync_parallel(LPC47B27ISAState *s, bool drive_irq)
{
    uint16_t base = (s->config.parallel_base_msb << 8) |
                    s->config.parallel_base_lsb;
    bool decode = s->config.parallel_activate && base >= 0x100 &&
                  s->config.parallel_mode2 == 0;
    bool ecp = decode && (s->config.parallel_mode & 2);

