GenSayer/qemu-system-ia64/hw/isa/lpc47b27.c
    lpc47b27_set_irq_target(s, LPC47B27_IRQ_SOURCE_PARALLEL,
                           decode ? s->config.parallel_irq : 0, drive_irq);
    memory_region_transaction_begin();
    if (s->parallel_mapped &&
        (!decode || s->parallel_mapped_base != base ||
         s->parallel_ecp_mapped != ecp)) {
        lpc47b27_unmap_parallel(s);
    }
    if (decode && !s->parallel_mapped) {
        memory_region_add_subregion(s->io_space, base, &s->parallel_io);
        s->parallel_mapped_base = base;
        s->parallel_mapped = true;
        if (ecp) {
            memory_region_add_subregion(s->io_space, base + 0x400,
                                        &s->parallel_ecp_io);
            s->parallel_ecp_mapped = true;
        }
    }
    memory_region_transaction_commit();
}

static uint64_t lpc47b27_parallel_read(void *opaque, hwaddr addr, unsigned size)
{
    LPC47B27ISAState *s = opaque;
    unsigned mode = lpc47b27_parallel_mode(s);
    uint8_t value = 0xff;

    switch (addr) {
    case 0:
        if (mode == 0 || !(s->parallel_control & LPC47B27_PARALLEL_DIRECTION)) {
            value = s->parallel_data;
        }
        break;
    case 1:
        /* Unconnected peripheral inputs are pulled high, including BUSY. */
        value = 0x78;
        break;
    case 2:
        value = s->parallel_control;
        break;
    }
    trace_lpc47b27_parallel_read(addr, value);
    return value;
}

static void lpc47b27_parallel_write(void *opaque, hwaddr addr,
                                  uint64_t value, unsigned size)
{
    LPC47B27ISAState *s = opaque;

    trace_lpc47b27_parallel_write(addr, value);
    if (addr == 0) {
        if (lpc47b27_parallel_mode(s) == 3 &&
            !(s->parallel_control & LPC47B27_PARALLEL_DIRECTION)) {
            lpc47b27_parallel_push(s, value);
        } else {
            s->parallel_data = value;
        }
    } else if (addr == 2) {
        s->parallel_control = value & 0x3f;
        lpc47b27_parallel_service(s);
    }
}

static uint64_t lpc47b27_parallel_ecp_read(void *opaque, hwaddr addr,
                                        unsigned size)
{
    static const uint8_t irq_encoding[16] = {
        [5] = 7, [7] = 1, [9] = 2, [10] = 3,
        [11] = 4, [14] = 5, [15] = 6,
    };
    LPC47B27ISAState *s = opaque;
    unsigned mode = lpc47b27_parallel_mode(s);
    uint8_t value = 0xff;

    if (addr == 2) {
        value = s->parallel_ecr | (s->parallel_count == 0) |
                ((s->parallel_count == LPC47B27_PARALLEL_FIFO_SIZE) << 1);
    } else if (mode == 7) {
        value = addr == 0 ? 0x10 :
                (s->source_level[LPC47B27_IRQ_SOURCE_PARALLEL] << 6) |
                (irq_encoding[s->config.parallel_irq] << 3) |
                (s->config.parallel_dma < 4 ? s->config.parallel_dma : 0);
    } else if (addr == 0 && (mode == 6 ||
               (mode == 3 && (s->parallel_control &
                              LPC47B27_PARALLEL_DIRECTION)))) {
        value = lpc47b27_parallel_pop(s);
    }
    trace_lpc47b27_parallel_read(addr + 0x400, value);
    return value;
}

static void lpc47b27_parallel_ecp_write(void *opaque, hwaddr addr,
                                      uint64_t value, unsigned size)
{
    LPC47B27ISAState *s = opaque;
    unsigned mode = lpc47b27_parallel_mode(s);

    trace_lpc47b27_parallel_write(addr + 0x400, value);
    if (addr == 2) {
        s->parallel_ecr = value & 0xfc;
        lpc47b27_set_irq_source(s, LPC47B27_IRQ_SOURCE_PARALLEL, 0);
        if ((s->parallel_ecr >> 5) <= 1) {
            s->parallel_head = 0;
            s->parallel_count = 0;
        }
        lpc47b27_parallel_service(s);
    } else if (addr == 0 && (mode == 2 || mode == 6 ||
               (mode == 3 && !(s->parallel_control &
                               LPC47B27_PARALLEL_DIRECTION)))) {
        lpc47b27_parallel_push(s, value);
    }
}

static const MemoryRegionOps lpc47b27_parallel_ops = {
    .read = lpc47b27_parallel_read,
    .write = lpc47b27_parallel_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = { .min_access_size = 1, .max_access_size = 1 },
};

static const MemoryRegionOps lpc47b27_parallel_ecp_ops = {
    .read = lpc47b27_parallel_ecp_read,
    .write = lpc47b27_parallel_ecp_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = { .min_access_size = 1, .max_access_size = 1 },
};

static void lpc47b27_sync_uart(LPC47B27ISAState *s, bool drive_irq)
{
    LPC47B27UartConfig config;
    bool decode;

    lpc47b27_config_get_uart(&s->config, &config);
    decode = config.active && config.base_valid;

    lpc47b27_set_irq_target(s, LPC47B27_IRQ_SOURCE_UART,
                            decode ? config.irq : 0, drive_irq);

    memory_region_transaction_begin();
    if (s->uart_mapped &&
        (!decode || s->uart_mapped_base != config.base)) {
        lpc47b27_unmap_uart(s);
    }
    if (decode && !s->uart_mapped) {
        memory_region_add_subregion(s->io_space, config.base, &s->uart.io);
        s->uart_mapped_base = config.base;
        s->uart_mapped = true;
    }
    memory_region_transaction_commit();
}

static void lpc47b27_sync_i8042(LPC47B27ISAState *s, bool drive_irq)
{
    LPC47B27I8042Config config;

    lpc47b27_config_get_i8042(&s->config, &config);

    lpc47b27_set_irq_target(s, LPC47B27_IRQ_SOURCE_I8042_KBD,
                            config.active ? config.keyboard_irq : 0,
                            drive_irq);
    lpc47b27_set_irq_target(s, LPC47B27_IRQ_SOURCE_I8042_MOUSE,
                            config.active ? config.mouse_irq : 0,
                            drive_irq);

    memory_region_transaction_begin();
    if (!config.active) {
        lpc47b27_unmap_i8042(s);
    } else if (!s->i8042_mapped) {
        memory_region_add_subregion(s->io_space, LPC47B27_I8042_DATA_PORT,
                                    &s->i8042_data_alias);
        memory_region_add_subregion(s->io_space,
                                    LPC47B27_I8042_COMMAND_PORT,
                                    &s->i8042_command_alias);
        s->i8042_mapped = true;
    }
    memory_region_transaction_commit();
}

static uint64_t lpc47b27_config_io_read(void *opaque, hwaddr addr,
                                        unsigned size)
{
    LPC47B27ISAState *s = opaque;
    uint8_t value = lpc47b27_config_read(&s->config,
        addr ? LPC47B27_CONFIG_DATA_PORT : LPC47B27_CONFIG_INDEX_PORT);

