GenSayer/qemu-system-ia64/hw/isa/lpc47b27.c
    trace_lpc47b27_config_read(addr, s->config.ldn, s->config.index, value);
    return value;
}

static void lpc47b27_config_io_write(void *opaque, hwaddr addr,
                                     uint64_t value, unsigned size)
{
    LPC47B27ISAState *s = opaque;
    LPC47B27ConfigChange change;

    trace_lpc47b27_config_write(addr, s->config.ldn, s->config.index, value);
    change = lpc47b27_config_write(&s->config,
        addr ? LPC47B27_CONFIG_DATA_PORT : LPC47B27_CONFIG_INDEX_PORT,
        value);
    if (change & LPC47B27_CONFIG_CHANGE_UART_RESOURCES) {
        lpc47b27_sync_uart(s, true);
    }
    if (change & LPC47B27_CONFIG_CHANGE_I8042_RESOURCES) {
        lpc47b27_sync_i8042(s, true);
    }
    if (change & LPC47B27_CONFIG_CHANGE_PARALLEL) {
        lpc47b27_sync_parallel(s, true);
        lpc47b27_parallel_service(s);
    }
}

static const MemoryRegionOps lpc47b27_config_io_ops = {
    .read = lpc47b27_config_io_read,
    .write = lpc47b27_config_io_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 1,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 1,
    },
};

static bool lpc47b27_migration_config_valid(const LPC47B27ConfigState *c)
{
    return c->serial1_activate <= 1 &&
           !(c->serial1_base_msb & ~0x0fU) &&
           !(c->serial1_base_lsb & ~0xf8U) &&
           c->serial1_irq < ISA_NUM_IRQS &&
           !(c->serial1_mode & ~0x83U) &&
           c->keyboard_activate <= 1 &&
           c->keyboard_irq < ISA_NUM_IRQS &&
           c->mouse_irq < ISA_NUM_IRQS &&
           !(c->keyboard_mode & ~0xfcU) &&
           c->parallel_activate <= 1 &&
           !(c->parallel_base_msb & ~0x0fU) &&
           !(c->parallel_base_lsb & ~0xfcU) &&
           c->parallel_irq < ISA_NUM_IRQS && c->parallel_dma <= 7 &&
           c->parallel_mode2 <= 3;
}

static int lpc47b27_pre_load(void *opaque)
{
    LPC47B27ISAState *s = opaque;

    /* Clear derived decode and routing state before loading migration fields. */
    memset(s->routed_irq, 0, sizeof(s->routed_irq));
    memset(s->irq_level, 0, sizeof(s->irq_level));
    memory_region_transaction_begin();
    lpc47b27_unmap_uart(s);
    lpc47b27_unmap_i8042(s);
    lpc47b27_unmap_parallel(s);
    memory_region_transaction_commit();
    return 0;
}

static int lpc47b27_post_load(void *opaque, int version_id)
{
    LPC47B27ISAState *s = opaque;

    if (!lpc47b27_migration_config_valid(&s->config) ||
        s->parallel_head >= LPC47B27_PARALLEL_FIFO_SIZE ||
        s->parallel_count > LPC47B27_PARALLEL_FIFO_SIZE ||
        (s->parallel_control & ~0x3f) || (s->parallel_ecr & 3)) {
        error_report("invalid LPC47B27x configuration in migration stream");
        return -EINVAL;
    }

    /* Rebuild derived decode and routing state without driving IRQ sinks. */
    lpc47b27_sync_uart(s, false);
    lpc47b27_sync_i8042(s, false);
    lpc47b27_sync_parallel(s, false);
    lpc47b27_rebuild_irq_cache(s);
    return 0;
}

static const VMStateDescription vmstate_lpc47b27_isa = {
    .name = "lpc47b27-isa",
    .version_id = 1,
    .minimum_version_id = 1,
    .pre_load = lpc47b27_pre_load,
    .post_load = lpc47b27_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT16_EQUAL(config_iobase, LPC47B27ISAState),
        VMSTATE_UINT32_EQUAL(uart_input_clock_hz, LPC47B27ISAState),
        VMSTATE_BOOL(config.config_mode, LPC47B27ISAState),
        VMSTATE_UINT8(config.index, LPC47B27ISAState),
        VMSTATE_UINT8(config.ldn, LPC47B27ISAState),
        VMSTATE_UINT8(config.serial1_activate, LPC47B27ISAState),
        VMSTATE_UINT8(config.serial1_base_msb, LPC47B27ISAState),
        VMSTATE_UINT8(config.serial1_base_lsb, LPC47B27ISAState),
        VMSTATE_UINT8(config.serial1_irq, LPC47B27ISAState),
        VMSTATE_UINT8(config.serial1_mode, LPC47B27ISAState),
        VMSTATE_UINT8(config.keyboard_activate, LPC47B27ISAState),
        VMSTATE_UINT8(config.keyboard_irq, LPC47B27ISAState),
        VMSTATE_UINT8(config.mouse_irq, LPC47B27ISAState),
        VMSTATE_UINT8(config.keyboard_mode, LPC47B27ISAState),
        VMSTATE_BOOL_ARRAY(source_level, LPC47B27ISAState,
                           LPC47B27_IRQ_SOURCE_COUNT),
        VMSTATE_STRUCT(uart, LPC47B27ISAState, 0, vmstate_serial,
                       SerialState),
        VMSTATE_UINT8(config.parallel_activate, LPC47B27ISAState),
        VMSTATE_UINT8(config.parallel_base_msb, LPC47B27ISAState),
        VMSTATE_UINT8(config.parallel_base_lsb, LPC47B27ISAState),
        VMSTATE_UINT8(config.parallel_irq, LPC47B27ISAState),
        VMSTATE_UINT8(config.parallel_dma, LPC47B27ISAState),
        VMSTATE_UINT8(config.parallel_mode, LPC47B27ISAState),
        VMSTATE_UINT8(config.parallel_mode2, LPC47B27ISAState),
        VMSTATE_UINT8(parallel_data, LPC47B27ISAState),
        VMSTATE_UINT8(parallel_control, LPC47B27ISAState),
        VMSTATE_UINT8(parallel_ecr, LPC47B27ISAState),
        VMSTATE_UINT8_ARRAY(parallel_fifo, LPC47B27ISAState,
                           LPC47B27_PARALLEL_FIFO_SIZE),
        VMSTATE_UINT8(parallel_head, LPC47B27ISAState),
        VMSTATE_UINT8(parallel_count, LPC47B27ISAState),
        VMSTATE_UINT8(parallel_last, LPC47B27ISAState),
        VMSTATE_END_OF_LIST()
    },
};

static void lpc47b27_reset(DeviceState *dev)
{
    LPC47B27ISAState *s = LPC47B27_ISA(dev);

    lpc47b27_config_reset(&s->config);
    s->parallel_data = 0;
    s->parallel_control = 0;
    s->parallel_ecr = 0;
    memset(s->parallel_fifo, 0, sizeof(s->parallel_fifo));
    s->parallel_head = 0;
    s->parallel_count = 0;
    s->parallel_last = 0;
    lpc47b27_set_irq_source(s, LPC47B27_IRQ_SOURCE_PARALLEL, 0);
    if (s->resources_ready) {
        lpc47b27_sync_uart(s, true);
        lpc47b27_sync_i8042(s, true);
        lpc47b27_sync_parallel(s, true);
    }
}

static void lpc47b27_realize(DeviceState *dev, Error **errp)
{
    LPC47B27ISAState *s = LPC47B27_ISA(dev);
    ISADevice *isadev = ISA_DEVICE(dev);
    MemoryRegion *i8042_region;

    s->isa_bus = isa_bus_from_device(isadev);
    if (!s->isa_bus->irqs_in) {
        error_setg(errp,
                   "LPC47B27x requires registered ISA interrupt inputs");
        return;
    }
    if (s->config_iobase == UINT16_MAX) {
        error_setg(errp, "LPC47B27x configuration port pair overflows");
        return;
    }
    if (!s->uart_input_clock_hz ||
        s->uart_input_clock_hz % LPC47B27_UART_CLOCK_DIVISOR) {
        error_setg(errp,
                   "LPC47B27x UART input clock must be a nonzero multiple "
                   "of %u Hz", LPC47B27_UART_CLOCK_DIVISOR);
        return;
    }
    s->io_space = isa_address_space_io(isadev);

