GenSayer/qemu-system-ia64/hw/isa/lpc47b27.c
    s->uart.irq = qdev_get_gpio_in_named(dev, "irq-source",
                                         LPC47B27_IRQ_SOURCE_UART);
    qdev_prop_set_uint32(DEVICE(&s->uart), "baudbase",
                         s->uart_input_clock_hz /
                         LPC47B27_UART_CLOCK_DIVISOR);
    if (!qdev_realize(DEVICE(&s->uart), NULL, errp)) {
        return;
    }
    s->uart_realized = true;

    qdev_prop_set_uint64(DEVICE(&s->i8042), "mask",
                         LPC47B27_I8042_COMMAND_MASK);
    qdev_prop_set_uint32(DEVICE(&s->i8042), "size",
                         LPC47B27_I8042_MMIO_SIZE);
    qdev_connect_gpio_out(DEVICE(&s->i8042), I8042_KBD_IRQ,
        qdev_get_gpio_in_named(dev, "irq-source",
                               LPC47B27_IRQ_SOURCE_I8042_KBD));
    qdev_connect_gpio_out(DEVICE(&s->i8042), I8042_MOUSE_IRQ,
        qdev_get_gpio_in_named(dev, "irq-source",
                               LPC47B27_IRQ_SOURCE_I8042_MOUSE));
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->i8042), errp)) {
        qdev_unrealize(DEVICE(&s->uart));
        s->uart_realized = false;
        return;
    }
    s->i8042_realized = true;

    memory_region_init_io(&s->uart.io, OBJECT(s), &serial_io_ops, &s->uart,
                          "lpc47b27-uart", LPC47B27_UART_IO_SIZE);
    i8042_region = sysbus_mmio_get_region(SYS_BUS_DEVICE(&s->i8042), 0);
    memory_region_init_alias(&s->i8042_data_alias, OBJECT(s),
                             "lpc47b27-i8042-data", i8042_region, 0, 1);
    memory_region_init_alias(&s->i8042_command_alias, OBJECT(s),
                             "lpc47b27-i8042-command", i8042_region,
                             LPC47B27_I8042_COMMAND_MASK, 1);

    isa_register_ioport(isadev, &s->config_io, s->config_iobase);
    s->config_mapped = true;
    s->resources_ready = true;
    lpc47b27_sync_uart(s, true);
    lpc47b27_sync_i8042(s, true);
    lpc47b27_sync_parallel(s, true);
}

static void lpc47b27_unrealize(DeviceState *dev)
{
    LPC47B27ISAState *s = LPC47B27_ISA(dev);

    lpc47b27_disconnect_irqs(s);
    memory_region_transaction_begin();
    lpc47b27_unmap_uart(s);
    lpc47b27_unmap_i8042(s);
    lpc47b27_unmap_parallel(s);
    if (s->config_mapped) {
        memory_region_del_subregion(s->io_space, &s->config_io);
        s->config_mapped = false;
    }
    memory_region_transaction_commit();
    s->resources_ready = false;

    if (s->i8042_realized) {
        qdev_unrealize(DEVICE(&s->i8042));
        s->i8042_realized = false;
    }
    if (s->uart_realized) {
        qdev_unrealize(DEVICE(&s->uart));
        s->uart_realized = false;
    }
    s->isa_bus = NULL;
    s->io_space = NULL;
}

static void lpc47b27_init(Object *obj)
{
    LPC47B27ISAState *s = LPC47B27_ISA(obj);

    lpc47b27_config_reset(&s->config);
    memory_region_init_io(&s->config_io, obj, &lpc47b27_config_io_ops, s,
                          "lpc47b27-config", LPC47B27_CONFIG_IO_SIZE);
    memory_region_init_io(&s->parallel_io, obj, &lpc47b27_parallel_ops, s,
                          "lpc47b27-parallel", 3);
    memory_region_init_io(&s->parallel_ecp_io, obj, &lpc47b27_parallel_ecp_ops,
                          s, "lpc47b27-parallel-ecp", 3);

    object_initialize_child(obj, "uart", &s->uart, TYPE_SERIAL);
    object_property_add_alias(obj, "chardev", OBJECT(&s->uart), "chardev");
    object_property_add_alias(obj, "wakeup", OBJECT(&s->uart), "wakeup");
    object_initialize_child(obj, "i8042", &s->i8042, TYPE_I8042_MMIO);
    qdev_init_gpio_in_named(DEVICE(obj), lpc47b27_set_irq_source,
                            "irq-source", LPC47B27_IRQ_SOURCE_COUNT);
}

static const Property lpc47b27_properties[] = {
    DEFINE_PROP_UINT16(LPC47B27_ISA_PROP_CONFIG_IOBASE, LPC47B27ISAState,
                       config_iobase, LPC47B27_CONFIG_INDEX_PORT),
    DEFINE_PROP_UINT32(LPC47B27_ISA_PROP_UART_INPUT_CLOCK_HZ,
                       LPC47B27ISAState, uart_input_clock_hz,
                       LPC47B27_UART_INPUT_CLOCK_HZ),
};

static void lpc47b27_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->desc = "LPC47B27x ISA integration";
    dc->realize = lpc47b27_realize;
    dc->unrealize = lpc47b27_unrealize;
    dc->vmsd = &vmstate_lpc47b27_isa;
    dc->user_creatable = false;
    device_class_set_legacy_reset(dc, lpc47b27_reset);
    device_class_set_props(dc, lpc47b27_properties);
    set_bit(DEVICE_CATEGORY_INPUT, dc->categories);
}

static const TypeInfo lpc47b27_info = {
    .name = TYPE_LPC47B27_ISA,
    .parent = TYPE_ISA_DEVICE,
    .instance_size = sizeof(LPC47B27ISAState),
    .instance_init = lpc47b27_init,
    .class_init = lpc47b27_class_init,
};

static void lpc47b27_register_types(void)
{
    type_register_static(&lpc47b27_info);
}

type_init(lpc47b27_register_types)
